In [10]:
import pandas as pd
# skip footer donc work with default engine C so we have to specify python
df = pd.read_csv("C:\sandbox\workspace\python\explore_py_libs\Pandas\international-airline-passengers.csv",
                 engine="python", skipfooter=3)

In [11]:
df.columns

Index(['Month', 'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

In [12]:
df.columns = ['Month','Passengers']

In [13]:
df.columns

Index(['Month', 'Passengers'], dtype='object')

In [17]:
# adding series of ones 
df['ones'] = 1
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Month</th>
      <th>Passengers</th>
      <th>ones</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1949-01</td>
      <td>112</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1949-02</td>
      <td>118</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1949-03</td>
      <td>132</td>
      <td>1</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1949-04</td>
      <td>129</td>
      <td>1</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1949-05</td>
      <td>121</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

In [20]:
# apply function 
from datetime import datetime
datetime.strptime("1949-05", "%Y-%m")

datetime.datetime(1949, 5, 1, 0, 0)

In [23]:
df['dt'] = df.apply(lambda row : datetime.strptime(row['Month'], "%Y-%m"), axis = 1)
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Month</th>
      <th>Passengers</th>
      <th>ones</th>
      <th>dt</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1949-01</td>
      <td>112</td>
      <td>1</td>
      <td>1949-01-01</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1949-02</td>
      <td>118</td>
      <td>1</td>
      <td>1949-02-01</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1949-03</td>
      <td>132</td>
      <td>1</td>
      <td>1949-03-01</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1949-04</td>
      <td>129</td>
      <td>1</td>
      <td>1949-04-01</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1949-05</td>
      <td>121</td>
      <td>1</td>
      <td>1949-05-01</td>
    </tr>
  </tbody>
</table>
</div>